Task6:-
========
convert "name" column to upper case

Given:-
--------
name  dept  
ravi  sales
manu  purch
hari  accts
ranjan  finan

Expected1:-
----------
name  dept  
RavI  sales
ManU  purch
HarI  accts
RanjaN  finan

Expected2:-
----------
name   dept  
RAVI   SALES
MANU   PURCH
HARI   ACCTS
RANJAN FINAN

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'name': ['ravi','manu','hari','ranjan'],
         'dept': ['sales','purch','accts','finan']}
df_temp = pd.DataFrame(data)
df_temp

     name   dept
0    ravi  sales
1    manu  purch
2    hari  accts
3  ranjan  finan

In [3]:
df_temp.to_csv('names.csv',index = False)

In [4]:
df = pd.read_csv('names.csv')
df

     name   dept
0    ravi  sales
1    manu  purch
2    hari  accts
3  ranjan  finan

In [5]:
res1 = df.copy()

In [6]:
res1['name'] = res1['name'].str[0].str.upper() + res1['name'].str[1:-1] + res1['name'].str[-1].str.upper()
res1

     name   dept
0    RavI  sales
1    ManU  purch
2    HarI  accts
3  RanjaN  finan

In [7]:
res2 = df.copy()

In [8]:
res2

     name   dept
0    ravi  sales
1    manu  purch
2    hari  accts
3  ranjan  finan

In [9]:
res2['name'] = res2['name'].str.upper()
res2['dept']= res2['dept'].str.upper()
res2

     name   dept
0    RAVI  SALES
1    MANU  PURCH
2    HARI  ACCTS
3  RANJAN  FINAN